In [3]:
#1:
import pandas as pd
data = pd.Series([4, 8, 15, 16, 23, 42])
print(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
#2:
lst = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
series = pd.Series(lst)
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [5]:
#3:
data = {"Name":['alice','bob','claire'],"Age":[25,30,27],"Gender":['female','male','female']}
pd.DataFrame(data)

     Name  Age  Gender
0   alice   25  female
1     bob   30    male
2  claire   27  female

In [6]:
#4:
# DataFrame: A 2D labeled data structure with columns of potentially different types (like a table).
# Series: A 1D labeled array that holds a single data type.

In [7]:
#5:
'''
Common Functions:
df.head(): View first rows.
df.drop(): Remove columns/rows.
df.fillna(): Fill missing values.
'''

'\nCommon Functions:\ndf.head(): View first rows.\ndf.drop(): Remove columns/rows.\ndf.fillna(): Fill missing values.\n'

In [8]:
#6:
# Mutable: Series and DataFrame are mutable; Panel (deprecated) is also mutable.

In [10]:
#7:
s1 = pd.Series([1, 2, 3])
s2 = pd.Series(['a', 'b', 'c'])
pd.DataFrame({'Numbers': s1, 'Letters': s2})

   Numbers Letters
0        1       a
1        2       b
2        3       c